const main = document.querySelector('main')

const data = {
    home: {
        name: 'Welcome',
        img: 'img/aether.png',
        content: [
            `ยินดีต้อนรับ โปรดเลือกดูตัวละครที่ฉันชอบ`,
        ],
    },
    venti: {
        name: 'Venti',
        img: 'img/venti.png',
        content: [
            `หนึ่งในนักกวีพเนจร ที่มีอยู่มากมายใน Mondstadt ผู้เดินเตร่ไปตามถนนซอกซอย อย่างอิสรเสรี`,
            `กวีที่ไม่มีใครรู้ที่มา บางครั้งก็ขับขานบทเพลงที่เก่าโบราณคร่ำครึ บางครั้งก็ขับขานบทเพลงแปลกใหม่ที่ไม่มีใครเคยฟัง
            ชื่นชอบแอปเปิ้ลและบรรยากาศที่มีชีวิตชีวา เกลียดชีสและของที่มันเหนียว ๆ
            ในเวลาที่ร่ายเวทธาตุ “ลม” นั้นมักจะทำให้เป็นรูปขนนก เพราะว่าเขาชื่นชอบการเฝ้ามองสิ่งของที่ดูเบา ๆ ล่องลอยไปมา`
        ],
    },
    xiao: {
        name: 'Xiao',
        img: 'img/xiao.png',
        content: [
            `ยักษา เซียนผู้พิทักษ์ Liyue ผู้ได้รับสมญานาม “ผู้กำราบอสูร” หรือ “ยักษาผู้พิทักษ์”`,
            `แม้ว่ารูปร่างหน้าตาจะเป็นชายหนุ่มอายุน้อยแต่อายุของ Xiao นั้นก็เกินกว่าสองพันปีมาแล้ว
            โชคดีที่ไม่มีใครดูถูกเขาเพราะรูปร่างหน้าตา เพราะไม่ว่าใครก็สามารถรู้สึกได้ว่าชายหนุ่มคนนี้เป็นคนที่ดุร้าย
            …อันตราย, เคร่งขรึม สายตาคมราวกับใบมีด
            ถึงแม้ว่าในสายตาของเหล่าเซียนนั้นชื่อเสียงและความอาวุโสของเขาถือว่าอยู่ในระดับสูงศักดิ์ แต่ท่ามกลางผู้คนแล้วเขากลับไม่เป็นที่รู้จักเท่าใดนัก
            ซึ่งก็เป็นสิ่งที่หลีกเลี่ยงไม่ได้ เขานั้นไม่ใช่สัญลักษณ์ของความเป็นมงคล ไม่สามารถให้ความร่ำรวย หรือเป็นดาวนำโชคได้ และก็ไม่ได้อาศัยอยู่บน Jueyun Karst ที่เป็นสัญลักษณ์ของความเป็นเซียนด้วย
            หากผู้ใดเห็น Xiao ใช้พลังเวทมนตร์ของเขา สถานการณ์ของผู้นั้นเกรงว่าจะอยู่ระหว่างความเป็นและตาย อันตรายเป็นอย่างยิ่ง
            ไม่ใช่ว่า Xiao ต้องการทำร้ายผู้คน แต่เพียงเพราะว่า Xiao นั้นต้องต่อสู้กับความมืดที่มีพลังเพียงพอจะกลืนกินแสงสว่างของ Liyue มาโดยตลอด ซึ่งหากคนธรรมดาเข้าไปใกล้การต่อสู้ก็จะได้รับผลกระทบอย่างหลีกเลี่ยงไม่ได้
            แน่นอนว่านี่ไม่ใช่ความลับที่จะต้องถูกปิดปากหรอกนะ`
        ],
    },
    kazuha: {
        name: 'Kazuha',
        img: 'img/kazuha.png',
        content: [
            `ซามูไรพเนจรของ Inazuma ตอนนี้อาศัยอยู่ในกองเรือ Crux ของ Liyue นิสัยอ่อนโยนและรักอิสระ มีเหตุการณ์ในอดีตมากมายฝังอยู่ในใจของเขา            `,
            `ครั้งแรกที่ได้พบกับ Kaedehara Kazuha คนส่วนใหญ่ต่างคิดว่าเขาเป็นเพียงลูกเรือฝึกหัดของกองเรือ Crux
            ชายหนุ่มมีนิสัยรักสงบ เขาชอบท่องบทกวีเมื่อมีเวลาว่าง และมักจะมีท่าทีสบาย ๆ เมื่อพูดคุยกับคนอื่น ใครจะไปคาดคิดล่ะว่า เขาเป็นผู้หลบหนีอันตรายที่ Inazuma Shogunate ต้องการตัว
            ก่อนที่จะตัดสินใจรับ Kaedehara Kazuha เข้ามา แม้แต่กัปตัน Beidou ที่เก่งกาจด้านการมองคนเป็นอย่างดี ก็ยังดูไม่ออกว่าชายหนุ่มที่สงบเงียบคนนี้จะมีความสามารถในการใช้ดาบอย่างน่าทึ่ง ราวกับเป็นคนที่ผ่านการต่อสู้มามากมาย
            ยิ่งไปกว่านั้น ไม่มีใครรู้ว่านิสัยที่แท้จริงของเขาเป็นผลมาจากทุกสิ่งที่เขาเคยผ่านมา หรือเป็นเพียงนิสัยโดยธรรมชาติที่ทำให้เขาซ่อนคมดาบเอาไว้กันแน่`
        ],
    }
}

const nav = document.querySelectorAll('a[data-target]');
nav.forEach(a=>{
    a.addEventListener('click', (e)=>{
        e.preventDefault();
        const target = e.target.dataset.target;
        if (loadPage(target)){
            history.pushState(null, null, '#' + target);
            clearActiveState();
            a.classList.add('active')
        }
    })
})

/* read location */
const readLocation = ()=>{
    const path = window.location.hash;
    const page = path.split('#').pop();
    console.log(page);
    return loadPage(page);
}
if (!readLocation()){
    loadPage('home');
}

function loadPage(page){
    if (!data[page]) return false;
    main.querySelector('article h1').innerText = data[page].name;
    main.querySelector('article div').innerHTML = data[page].content.map(c=>`<p>${c}</p>`).join('');
    main.querySelector('article img.display').src = data[page].img;
    return true;
}

function clearActiveState(){
    nav.forEach(a=>{
        a.classList.remove('active');
    })
}